[
    {
        "id" : "Rust",
        "data_types" : "Every value in Rust is of a certain data type, which tells Rust what kind of data is being specified so it knows how to work with that data. We’ll look at two data type subsets: scalar and compound.",
        "variables" : "As mentioned in the “Storing Values with Variables” section, by default variables are immutable. This is one of many nudges Rust gives you to write your code in a way that takes advantage of the safety and easy concurrency that Rust offers. However, you still have the option to make your variables mutable. Let’s explore how and why Rust encourages you to favor immutability and why sometimes you might want to opt out.",
        "conditions" : "In this Rust tutorial we learn how to control the flow of our Rust application with if, else if, else, and match conditional statements.We also cover how to nest conditional statements inside other conditional statements as well as how to conditionally assign a value to a variable if the if let expression.",
        "loops" : "Rust provides different types of loops to handle looping requirements : while,loop,for",
        "oop" : "Given the popularity of oops, it would come as surprise to most that we do not have clear consensus among programmer for features required to determine if an language is object oriented or not.Rust is multi-paradigm language and supports light weight version oops support like it contemporary Go. But it is no where as powerful as java and python."
    },
    {
        "id" : "C++",
        "data_types" : "You may like to store information of various data types like character, wide character, integer, floating point, double floating point, boolean etc. Based on the data type of a variable, the operating system allocates memory and decides what can be stored in the reserved memory.",
        "variables" : "The usefulness of the 'Hello World' programs shown in the previous chapter is rather questionable. We had to write several lines of code, compile them, and then execute the resulting program, just to obtain the result of a simple sentence written on the screen. It certainly would have been much faster to type the output sentence ourselves.",
        "conditions" : "In this tutorial, we will learn about the if...else statement to create decision making programs with the help of examples.In computer programming, we use the if...else statement to run one block of code under certain conditions and another block of code under different conditions.",
        "loops" : "There may be a situation, when you need to execute a block of code several number of times. In general, statements are executed sequentially: The first statement in a function is executed first, followed by the second, and so on.Programming languages provide various control structures that allow for more complicated execution paths.A loop statement allows us to execute a statement or group of statements multiple times and following is the general from of a loop statement in most of the programming language.",
        "oop" : "Object-oriented programming – As the name suggests uses objects in programming. Object-oriented programming aims to implement real-world entities like inheritance, hiding, polymorphism, etc in programming. The main aim of OOP is to bind together the data and the functions that operate on them so that no other part of the code can access this data except that function."
    },
    {
        "id" : "Python",
        "data_types" : "Every value in Python has a datatype. Since everything is an object in Python programming, data types are actually classes and variables are instance (object) of these classes.",
        "variables" : "In the previous tutorial on Basic Data Types in Python, you saw how values of various Python data types can be created. But so far, all the values shown have been literal or constant values.",
        "conditions" : "Conditional Statement in Python perform different computations or actions depending on whether a specific Boolean constraint evaluates to true or false. Conditional statements are handled by IF statements in Python.In this tutorial, we will see how to apply conditional statements in Python.",
        "loops" : "The for loop in Python is an iterating function. If you have a sequence object like a list, you can use the for loop to iterate over the items contained within the list.The functionality of the for loop isn't very different from what you see in multiple other programming languages.",
        "oop" : "In Python, object-oriented Programming (OOPs) is a programming paradigm that uses objects and classes in programming. It aims to implement real-world entities like inheritance, polymorphisms, encapsulation, etc. in the programming."
    },
    {
        "id" : "Java",
        "data_types" : "Data types are divided into two groups: Primitive data types - includes byte , short , int , long , float , double , boolean and char. Non-primitive data types - such as String , Arrays and Classes.",
        "variables" : "Variable in Java is a data container that saves the data values during Java program execution. Every variable is assigned a data type that designates the type and quantity of value it can hold. A variable is a memory location name for the data. A variable is a name given to a memory location.",
        "conditions" : "In this tutorial, you will learn about control flow statements using Java if and if...else statements with the help of examples.In programming, we use the if..else statement to run a block of code among more than one alternatives. For example, assigning grades (A, B, C) based on the percentage obtained by a student.",
        "loops" : "Looping in programming languages is a feature which facilitates the execution of a set of instructions/functions repeatedly while some condition evaluates to true. Java provides three ways for executing the loops. While all the ways provide similar basic functionality, they differ in their syntax and condition checking time.",
        "oop" : "Java - What is OOP? OOP stands for Object-Oriented Programming. Procedural programming is about writing procedures or methods that perform operations on the data, while object-oriented programming is about creating objects that contain both data and methods."
    },
    {
        "id" : "Golang",
        "data_types" : "Go has three basic data types: bool: represents a boolean value and is either true or false. Numeric: represents integer types, floating point values, and complex types. string: represents a string value.",
        "variables" : "In Go language variables are created in two different ways: Using var keyword: In Go language, variables are created using var keyword of a particular type, connected with name and provide its initial value. Important Points: In the above syntax, either type or = expression can be omitted, but not both.",
        "conditions" : "Conditional statements allow you to execute decisions based on logic that evaluates to true or false. Some examples of conditional statements include if statements, if…else, if…else if.. else, and switch-case statements. Go has full support for these conditionals with a familiar and straightforward syntax.",
        "loops" : "Go language contains only a single loop that is for-loop. A for loop is a repetition control structure that allows us to write a loop that is executed a specific number of times. In Go language, this for loop can be used in the different forms.",
        "oop" : "The building blocks of Golang are types, functions, and packages—in contrast to classes in object-oriented languages like Java. However, three of the four concepts of OOP (encapsulation, abstraction, and polymorphism) are available, and the missing type hierarchy is replaced by interfaces and duck typing."
    },
    {
        "id" : "PHP",
        "data_types" : "Data Types define the type of data a variable can store. PHP allows eight different types of data types. All of them are discussed below. There are pre-defined, user-defined, and special data types.The predefined data types are:Boolean,Integer,Double,String. The user-defined (compound) data types are:Array,Objects.",
        "variables" : "All variables in PHP start with a $ (dollar) sign followed by the name of the variable.A valid variable name starts with a letter (A-Z, a-z) or underscore (_), followed by any number of letters, numbers, or underscores.If a variable name is more than one word, it can be separated with an underscore (for example $employee_code instead of $employeecode).'$' is a special variable that can not be assigned.",
        "conditions" : "Decisions are an integral part of life. From the mundane decisions about what to wear, to the life-altering decisions of jobs and family. So too in development. For a program to do anything useful, it must be able to respond to some sort of input. When a person clicks the contact button on a website, they expect to be taken to a contact page. If nothing happens, or they are taken to the wrong page, the user may choose to stop using that website or company completely.",
        "loops" : "Loops are used to execute the same block of code again and again, as long as a certain condition is met. The basic idea behind a loop is to automate the repetitive tasks within a program to save the time and effort. PHP supports four different types of loops.while — loops through a block of code as long as the condition specified evaluates to true.do…while — the block of code executed once and then condition is evaluated. If the condition is true the statement is repeated as long as the specified condition is true.for — loops through a block of code until the counter reaches a specified number.foreach — loops through a block of code for each element in an array.",
        "oop" : "A class is an entity that determines how an object will behave and what the object will contain. In other words, it is a blueprint or a set of instruction to build a specific type of object.In PHP, declare a class using the class keyword, followed by the name of the class and a set of curly braces ({})."
    }
]